eurkaaaa/Apollo_cam_vl53l9/STM32CubeIDE/Appli/Application/User/BSP/src/cmw_camera.c
  Camera_Ctx.Exposure = exposure;
  return CMW_ERROR_NONE;
}

/**
  * @brief  Get the camera exposure.
  * @param  exposure exposure in microseconds
  * @retval CMW status
  */
int CMW_CAMERA_GetExposure(int32_t *exposure)
{
  *exposure = Camera_Ctx.Exposure;
  return CMW_ERROR_NONE;
}

/**
  * @brief  Set the camera exposure mode.
  * @param  exposureMode Exposure mode CMW_EXPOSUREMODE_AUTO, CMW_EXPOSUREMODE_AUTOFREEZE, CMW_EXPOSUREMODE_MANUAL
  * @retval CMW status
  */
int32_t CMW_CAMERA_SetExposureMode(int32_t exposureMode)
{
  int ret;

  if(Camera_Drv.SetExposureMode == NULL)
  {
    return CMW_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = Camera_Drv.SetExposureMode(&camera_bsp, exposureMode);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  Camera_Ctx.ExposureMode = exposureMode;
  return CMW_ERROR_NONE;
}

/**
  * @brief  Get the camera exposure mode.
  * @param  exposureMode Exposure mode CAMERA_EXPOSURE_AUTO, CAMERA_EXPOSURE_AUTOFREEZE, CAMERA_EXPOSURE_MANUAL
  * @retval CMW status
  */
int32_t CMW_CAMERA_GetExposureMode(int32_t *exposureMode)
{
  *exposureMode = Camera_Ctx.ExposureMode;
  return CMW_ERROR_NONE;
}

/**
  * @brief  Set (Enable/Disable and Configure) the camera test pattern
  * @param  mode Pattern mode (sensor specific value) to be configured. '-1' means disable.
  * @retval CMW status
  */
int32_t CMW_CAMERA_SetTestPattern(int32_t mode)
{
  int32_t ret;

  if(Camera_Drv.SetTestPattern == NULL)
  {
    return CMW_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = Camera_Drv.SetTestPattern(&camera_bsp, mode);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  Camera_Ctx.TestPattern = mode;
  return CMW_ERROR_NONE;
}

/**
  * @brief  Get the camera test pattern
  * @param  mode Pattern mode (sensor specific value) to be returned. '-1' means disable.
  * @retval CMW status
  */
int32_t CMW_CAMERA_GetTestPattern(int32_t *mode)
{
  *mode = Camera_Ctx.TestPattern;
  return CMW_ERROR_NONE;
}

/**
  * @brief  Get the Camera Sensor info.
  * @param  info  pointer to sensor info
  * @note   This function should be called after the init. This to get Capabilities
  *         from the camera sensor
  * @retval Component status
  */
int32_t CMW_CAMERA_GetSensorInfo(ISP_SensorInfoTypeDef *info)
{

  int32_t ret;

  if(Camera_Drv.GetSensorInfo == NULL)
  {
    return CMW_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = Camera_Drv.GetSensorInfo(&camera_bsp, info);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  return CMW_ERROR_NONE;
}



int32_t CMW_CAMERA_Run()
{
  if(Camera_Drv.Run != NULL)
  {
      return Camera_Drv.Run(&camera_bsp);
  }
  return CMW_ERROR_NONE;
}

///**
// * @brief  Vsync Event callback on pipe
// * @param  Pipe  Pipe receiving the callback
// * @retval None
// */
//__weak int CMW_CAMERA_PIPE_VsyncEventCallback(uint32_t pipe)
//{
//  UNUSED(pipe);
//
//  return HAL_OK;
//}
//
///**
// * @brief  Frame Event callback on pipe
// * @param  Pipe  Pipe receiving the callback
// * @retval None
// */
//__weak int CMW_CAMERA_PIPE_FrameEventCallback(uint32_t pipe)
//{
//  UNUSED(pipe);
//
//  return HAL_OK;
//}
//
///**
// * @brief  Vsync Event callback on pipe
// * @param  hdcmipp DCMIPP device handle
// *         Pipe    Pipe receiving the callback
// * @retval None
// */
//void HAL_DCMIPP_PIPE_VsyncEventCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
//{
//  UNUSED(hdcmipp);
//  if(Camera_Drv.VsyncEventCallback != NULL)
//  {
//      Camera_Drv.VsyncEventCallback(&camera_bsp, Pipe);
//  }
//  CMW_CAMERA_PIPE_VsyncEventCallback(Pipe);
//}
//
///**
// * @brief  Frame Event callback on pipe
// * @param  hdcmipp DCMIPP device handle
// *         Pipe    Pipe receiving the callback
// * @retval None
// */
//void HAL_DCMIPP_PIPE_FrameEventCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
//{
//  UNUSED(hdcmipp);
//  if(Camera_Drv.FrameEventCallback != NULL)
//  {
//      Camera_Drv.FrameEventCallback(&camera_bsp, Pipe);
//  }
//  CMW_CAMERA_PIPE_FrameEventCallback(Pipe);
//}
//
///**
//  * @brief  Initializes the DCMIPP MSP.
//  * @param  hdcmipp  DCMIPP handle
//  * @retval None
//  */
//void HAL_DCMIPP_MspInit(DCMIPP_HandleTypeDef *hdcmipp)
//{
//  UNUSED(hdcmipp);
//
//  /*** Enable peripheral clock ***/
//  /* Enable DCMIPP clock */
//  __HAL_RCC_DCMIPP_CLK_ENABLE();
//  __HAL_RCC_DCMIPP_CLK_SLEEP_ENABLE();
//  __HAL_RCC_DCMIPP_FORCE_RESET();
//  __HAL_RCC_DCMIPP_RELEASE_RESET();
//
//  /*** Configure the NVIC for DCMIPP ***/
//  /* NVIC configuration for DCMIPP transfer complete interrupt */
//  HAL_NVIC_SetPriority(DCMIPP_IRQn, 0x07, 0);
//  HAL_NVIC_EnableIRQ(DCMIPP_IRQn);
//
//  /*** Enable peripheral clock ***/
//  /* Enable CSI clock */
//  __HAL_RCC_CSI_CLK_ENABLE();
//  __HAL_RCC_CSI_CLK_SLEEP_ENABLE();
//  __HAL_RCC_CSI_FORCE_RESET();
//  __HAL_RCC_CSI_RELEASE_RESET();
//
//  /*** Configure the NVIC for CSI ***/
//  /* NVIC configuration for CSI transfer complete interrupt */
//  HAL_NVIC_SetPriority(CSI_IRQn, 0x07, 0);
//  HAL_NVIC_EnableIRQ(CSI_IRQn);
//
//}
//
///**
//  * @brief  DeInitializes the DCMIPP MSP.
//  * @param  hdcmipp  DCMIPP handle
//  * @retval None
//  */
//void HAL_DCMIPP_MspDeInit(DCMIPP_HandleTypeDef *hdcmipp)
//{
//  UNUSED(hdcmipp);
//
//  __HAL_RCC_DCMIPP_FORCE_RESET();
//  __HAL_RCC_DCMIPP_RELEASE_RESET();
//
//  /* Disable NVIC  for DCMIPP transfer complete interrupt */
//  HAL_NVIC_DisableIRQ(DCMIPP_IRQn);
//
//  /* Disable DCMIPP clock */
//  __HAL_RCC_DCMIPP_CLK_DISABLE();
//
//  __HAL_RCC_CSI_FORCE_RESET();
//  __HAL_RCC_CSI_RELEASE_RESET();
//
//  /* Disable NVIC  for DCMIPP transfer complete interrupt */
//  HAL_NVIC_DisableIRQ(CSI_IRQn);
//
//  /* Disable DCMIPP clock */
//  __HAL_RCC_CSI_CLK_DISABLE();
//}

/**
  * @brief  CAMERA hardware reset
  * @retval CMW status
  */
static void CMW_CAMERA_EnableGPIOs(void)
{
  GPIO_InitTypeDef gpio_init_structure = {0};

  /* Enable GPIO clocks */
  XSHUTDOWN_GPIO_ENABLE_VDDIO();
  XSHUTDOWN_GPIO_CLK_ENABLE();

  gpio_init_structure.Pin       = XSHUTDOWN_Pin;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(XSHUTDOWN_GPIO_Port, &gpio_init_structure);


